Tekla Open API Reference for Tekla Structures 2025
HelpViewer.DisplayHelpTopic Method
 Method for opening Tekla Structures help viewer with given help topic. Method requires Tekla Structures to be running.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool DisplayHelpTopic(
	string helpTopic
)
Public Shared Function DisplayHelpTopic (
	helpTopic As String
) As Boolean
Parameters
helpTopic
Type: System.String
Help topic (e.g. Help file name without extension).
Return Value
Type: Boolean
True if success, otherwise false.
Exceptions
Exception | Condition
InvalidOperationException | Thrown when connection to Tekla Structures failed.
See Also
Reference
HelpViewer Class
Tekla.Structures.Dialog Namespace